bench/results/rust-axum/v3-20260523-111612-rust-axum/read-c500.txt
Running 30s test @ http://localhost:3001
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.82ms    1.29ms  26.17ms   71.69%
    Req/Sec     3.90k     1.08k   27.85k    77.38%
  931285 requests in 30.10s, 219.46MB read
  Socket errors: connect 253, read 0, write 0, timeout 0
Requests/sec:  30939.21
Transfer/sec:      7.29MB