bench/results/rust-axum/v3-20260523-111612-rust-axum/write-c50.txt
Running 20s test @ http://localhost:3001
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.24ms  604.28us  20.52ms   82.66%
    Req/Sec     5.40k   429.10     6.14k    72.76%
  432194 requests in 20.10s, 101.45MB read
  Non-2xx or 3xx responses: 313643
Requests/sec:  21501.03
Transfer/sec:      5.05MB